app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("signature", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["signature", ""], ["created_at", "2023-11-11 16:24:24.110345"], ["updated_at", "2023-11-11 16:24:24.110345"]]

  def destroy
    @user.destroy!
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]